---
type: ProjectInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ProjectInfo

`Autodesk.Revit.DB.ProjectInfo` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Address | — | `public string Address { get ; set ; }` |
| Property | Author | — | `public string Author { get ; set ; }` |
| Property | BuildingName | — | `public string BuildingName { get ; set ; }` |
| Property | ClientName | — | `public string ClientName { get ; set ; }` |
| Property | IssueDate | — | `public string IssueDate { get ; set ; }` |
| Property | Name | — | `public string Name { get ; set ; }` |
| Property | Number | — | `public string Number { get ; set ; }` |
| Property | OrganizationDescription | — | `public string OrganizationDescription { get ; set ; }` |
| Property | OrganizationName | — | `public string OrganizationName { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Status | — | `public string Status { get ; set ; }` |